package ru.mirea.practice.s23K0135;

/**********************************************************************
 * Написать программу, в результате работы которой выводятся на экран *
 * первые 10 чисел гармонического ряда (форматировать вывод).         *
 **********************************************************************/

public abstract class Task6 {
    public static void main(String[] args) {
        String template = "%d-ое число гармонического ряда: %.3f; 1/%d\n";

        for (int i = 0; i < 10; ++i) {
            System.out.format(template, i + 1, 1.0 / (i + 1), i + 1);
        }

    }
}
