package ru.mirea.practice.s23k1167;

/**
 * Напишите метод, который принимает в качестве параметра любую
 * строку, например “I like Java!!!”.
 */

public abstract class Task1 {
    static void method(String param) {
        System.out.println("Получена стока:");
        System.out.println(param);
    }
}